Repository: seanpm2001/mt-training-data
Catalog: ss/ss_pontoon.tmx
Source language: en_us
Languages: ss

source: Speech is often the most natural way we communicate with each other and voice technologies are bringing that convenience to our computers and mobile devices. We want to empower developers to build amazing voice recognition applications like real-time translators and voice-enabled digital assistants. But right now most of the voice data required to build these kinds of apps is expensive and proprietary. We hope the Common Voice dataset will give developers what they need to innovate and make speech technology available in their own language. To make voice recognition even more universal, we're collecting voice samples in widely spoken languages as well as those with a smaller population of speakers often underserved by commercial speech recognition services. Publishing a diverse dataset of voices will empower developers, entrepreneurs, and entire speech communities to address this gap themselves.
ss: Inkhulumo yindlela yemvelo yekutsi sikhone kuchumana sodvwa kantsi futsi buchwephesha bebemaphimbo buletsa loku kalula kubo ngcondvomshina kanye nabo mashala ekukhukhwini. Sifuna kuniketa batfutfukisi betebucwephesha umfutfo kute bakhe tinhlelo tekuchumana ngekulalela ngenkhulumo njengeku humusha ngaleso sikhatsi kanye netinsita tebuchwephesha letisebenta ngemavi. Kepha kwanyalo luningi lwalolwati lwemavi lekwakha leti tinsita lidulile futsi lisemtsetfweni. Siyetsemba kutsi le Common Voice dataset itobaniketa batfutfukisi betebuchwephesha naku labakudzingako kute basungule futsi bakhe lobuchwephesha benkhulumo ngelulwimi lwabo. Kute wakhe lobuchwephesha bekuva inkhulumo busebente mhlaba wonkhe, sikweleka tinkhulumo letehlukahlukene ngetilwimi letijwayelekile kanye nateleto letikhulunywa tive letincane letingatiwa tinsita tenkhuluma letatiwako. Kusakata lolwati letinkhulumo kutolekelela bonjinela, bosomabhizinisi, kanye nawo wonkhe umkhakha wetetinkhuluma kutsi uvala tikhala letikhona emkhatsini wabo.

source: Speech-to-text (STT)
ss: Inkhulumo iyiswa emagameni (STT)

source: Speech-to-text (STT) technologies convert voice data into text.
ss: Bucwephesha be Speech-to-text (STT) bushintja livi kube ngumbhalo.

source: Split into { $archiveCount } ZIP files containing
ss: Hlephula kube{ $archiveCount } ngemafayela e ZIP lacuketse

source: Splits
ss: Kuhlukana

source: Start recording
ss: Cala kutfwebula

source: Start typing to describe your accent
ss: Cala kubhala uchaze indlela yakho yekukhuluma

source: Statistics
ss: Tibalo

source: Stats
ss: Tibalo

source: Status Page
ss: Lukasi lenchubo

source: <strong>[Crackle]</strong> giant dinosaurs of <strong>[crackle]</strong> -riassic.
ss: <strong>[Crackle]</strong> ema-dinasaur lamakhulu ase <strong>[crackle]</strong> -riassic.

source: <strong>Do not reject clips where the speaker ‘has an accent’ that is different to your own</strong> - this is important for voice recognition to work better for everyone.
ss: <strong>Ungawajikisi emafayela latfwebuliwe lapho sikhuluma 'sinesici tsite' lesehlukile kusakho</strong> - loku kumcokwa kute kuvakala kwelivi kusebentele wonkhe wonkhe.

source: <strong>Get creative!</strong> Your language community will be unique, and these are just a few ways to get started.
ss: <strong>Get creative!</strong> Bani nemibono! umango wakho welulwimi utohluka, leti tindlela letincane nje tekucala.

source: <strong>Sentence Collector</strong> is a tool for collecting and validating public domain sentences. You will <scAccountLink>need to create an account</scAccountLink>. Then, add your language to your <strong>Profile</strong>. You can <strong>Add</strong> sentences or <strong>Review</strong> previously-added sentences.
ss: <strong> I Sentence Collector </strong> lithulusi lekukweleka phindze liciniseke imisho lengasebentiswa sive. Uto dzinga kwakha <scAccountLink>lifayela lakho</scAccountLink>. Bese, wengeta lulwimi lwakho <strong>eFayeleni </strong>lakho. Ungaye <strong>ngeta</strong> imisho noma <strong>uhlolisise </strong> imisho leke yafakwa ngaphambilini.

source: <strong>[Sneeze]</strong> The giant dinosaurs of the <strong>[cough]</strong> Triassic.
ss: <strong>[Sneeze]</strong> ema-dinosaur lamakhulu e <strong>[cough]</strong> Triassic.

source: Submission: { $batchId }
ss: Kumikisa: { $batchId }

source: Submission Error
ss: Inkinga yekumikisa

source: Submit
ss: Hambisa

source: Submit a report
ss: Mikisa umbiko

source: Submit clips
ss: Mikisa ticeshana

source: Submitted sentences. { $duplicates } sentences were rejected as duplicates.
ss: Imisho lemikisiwe. { $duplicates } imisho ijikisiwe ngoba beseyiphindzekile.

source: Subscribe
ss: Bhalisa

source: Success
ss: Imphumelelo

source: Success, profile created!
ss: Imphumelelo, likhasi lelichaza kabanti ngawe lakhekile!

source: Swipe right to approve the sentence. Swipe left to reject it. Swipe up to skip it. <strong>Do not forget to submit your review!</strong>
ss: Hambisa ubhekise ngesekudla kuvuma lomugca. Hambisa ubhekise ngesencele kuwucitsa. Hambisa ubhekise etulu kuweca. <strong>Ungakhohlwa kuhambisa umbono wakho!</strong>

source: Taking several attempts to read a word.
ss: Kutsatsa emahlandla kufundza ligama.

source: Tap
ss: Tsintsa

source: Tatoeba is a large database of sentences, translations, and spoken audio for use in language learning. This download contains spoken English recorded by their community.
ss: Tatoeba ngumbhukudvu lomkhulu wemigca, emahumusho, kanye netinkhulumo tekusetjentiswa kufundza tilwimi. Lencenye lena icuketse Singisi lesitfubelwe kumphakatsi wabo.

source: Tell us what you'd like to download:
ss: Sitjele kutsi ungatsandza ku download ini:

source: Terms
ss: Imigomo

source: Thanks for confirming your account, now let's build your profile.
ss: Siyabonga kucinisekisa kutsi le-account ngeyakho, nyalo asakhe likhasi lelichaza kabanti ngawe.

source: Thanks to contributions from over 259k people in over 50 languages, this data is being used to train speech-enabled applications to better respond to the human voice.
ss: Siyabonga iminikelo lesuka kubantfu labangetulu kwa 259k etilwimini letingetulu kwa 50, lolwati lolu lusetjentiswa kucecesha tinhlelo tekuchumana kute tiphendvule ncono kumavi ebantfu.

source: Thank you for recording!<lineBreak></lineBreak>Now review and submit your clips below.
ss: Siyabonga kutfwebula! <lineBreak></lineBreak>Nyalo buyeketa bese umikisa ticephu takho letitfwebuliwe langentasi.

source: Thank you for your interest in contributing to { $lang }. We work hard to get every language ready for launch and keep the teams updated via email. If you want to contribute, please provide your email below.
ss: Siyabonga inshisekelo yakho ekunikeleni ku { $lang }. Sisebenta kametima kutfola tonkhe tilwimi tulungele kwetfulwa futsi sigcine licembu latisekeli ngeliposi lwembane. Uma ufuna kunikela , sicela usibhalele i email ngephansi.

source: Thank you! You’ve sent a new language enquiry
ss: Siyabonga! Utfumele sicelo lesisha selulwimi

source: The best sources you can look for are podcasts, transcripts, movie scripts and anything that potential can contain everyday conversations.
ss: Imitfombo lencono longayibuka ngema podcasts, ticeshana, imibhalo yemafilimu noma ke nanoma ngabe yini lengaba netinkhulumo temihla onkhe

source: The Clip Graveyard consists of voice clips that didn't make it into the Common Voice dataset. Just like the dataset, the Clip Graveyard is available for download. We would like to thank the following people and organizations for their help with the project:
ss: I Clip Graveyard icutseke ticeshana temavi langakhoni kungena kulombhudvu welwati wa Common Voice. Njengalombhukudvu, le Clip Graveyard nayo ivulekelwe kucashunwa. Sitawutsandza kubonga naba bantfu labalandzelako kanye netinhlangano ngelisuto kulomsebenti.

source: The clip has disrespectful or offensive language.
ss: Lesiceshana sinetinhlamba futsi siyalulata.

source: The Common Voice dataset complements Mozilla’s open source voice recognition engine Deep Speech. The first version of Deep Speech was released in November 2017 and has continued to evolve ever since. Together with the Common Voice dataset, we believe this open source voice recognition technology should be available to everybody. It’s our hope these technologies will enable developers to build a wave of innovative products and services.
ss: I-Common Voice dataset ihambisana nenjini ye-Mozilla levulekile yekucaphela Livi Lenkhulumo Lelijulile. Sigaba sekucala se-Deep Speech yakhululwa nge Lweti 2017 futsi isachubeka nekuvela kusukela ngaleso sikhatsi. Sikanye nemntfombo welwati we Common Voice, sikholelwa kutsi lobu buchwephesha bokubona livi kufanele butfolakale kuwo wonkhe umuntfu. Sitsemba kutsi lobu buchwepheshe butokwenta batfutfukisi kutsi bakwati kwakha ligagasi lemikhicito lemisha nemisebenti.

source: The Common Voice Dataset contains hundreds of thousands of voice samples that help developers build voice recognition tools.
ss: Le Dataset yaka Voice Command icuketse emakhulu latinkhulungwane etinkhulumo letitfwebuliwe letisita batfutfukisi kwakha emathulusi ekwemukela tinkhulumo letitfwebuliwe.

source: The Common Voice dataset is an open and publicly available resource that can be used to train a wide variety of speech-enabled applications. To protect the security of our contributors, we ask everyone who downloads the Common Voice dataset to respect contributors’ privacy. All voice clips in the dataset are scrubbed of personally identifying information. When you download the dataset, you agree to not attempt to determine the identity of any contributor. That means you cannot try to link information in the dataset to a contributor’s personal information. You may, however, use the dataset to train speech recognition, speaker recognition, or other applications, by, for instance, linking information in the dataset to other information already in the dataset.
ss: "Umtfombo welwati we-Common Voice uvulekile futsi lotfolakala esiveni ungasetjentiswa kucecesha tinhlobonhlobo tetinhlelo tekusebenta letikwati kukhuluma. Kute kuvikelwe kuphepha kwabanikeli betfu, sicela wonkhe umuntfu losebentisa lwati lwe Common Voice kutsi ahloniphe timfihlo talabo labanikele. Tonkhe ticeshana telivi kulomtfombo wetfu welwati tisuswa imininingwane webaniyo. Uma utsatsa leticeshana, uyavuma kutsi ngeke uzame kubona kutsi ngubani lolonikele. Loko kusho kutsi ngeke utame kuhlanganisa lwati kanye nemuntfu lonikele. Kepha, ungasebentisa ticeshana telwati kucecesha kwenkhulumo, kubona sikhulumi, noma letinye tinhlelo tekusebenta, ngekwesibonelo, ngekuchumanisa lwati lokusemtfombeni wetfu kanye nalolunye nelalomunye umtfombo."

source: The Common Voice dataset is available for download under the <licenseLink>CC0</licenseLink> license on <datasetLink>our Datasets page</datasetLink>. You can also download several other publicly available datasets from the same page.
ss: Lombhukudvu welwati waka Common Voice ukhona kutsi ungawusebentisa ngephansi kwe mvumo ye <licenseLink>CC0 </licenseLink><datasetLink>ekhasini letfu lelwati</datasetLink>. Ungaphindze utfole letinye tinhlobo telwati kulelo khasi.

source: The Common Voice Sentence Collector has collected { $sentenceCount } sentences in { $languageCount } languages!
ss: Sentence Collector wa Common Voice ukweleke { $sentenceCount } wemisho { $languageCount } ngetilwimi!

source: The count of voice recording hours that have been validated by 2 out of 3 users with a vote of “Yes”. These mark progress toward the overall project 10k hours goal.
ss: Sibalo semahora latfwebuliwe lasacinisekisiwe ngu 2 ku 3 webasebentisi bavote nga ""Yes"". Loku kusho inchubeka phambili ekufikeni kumgomo wama hora langu 10k.

source: The count of voice recording hours we have collected so far.
ss: Linani lema hora ekutfwebula emavi lesiwakolekile kute kube ngunamuhla.

source: The giant dinosaur of the Triassic.
ss: I dinosaur lenkhulu yase Triassic.

source: The giant dinosaurs of the Triassi-.
ss: Ema dinosaur lamakhulu ase Triassi-

source: The giant dinosaurs of the Triassic.
ss: Ema dinosaur lamakhulu ase Triassic.

source: The giant dinosaurs of the Triassic. <strong>[read by one voice]</strong>
ss: Ema-dinosaurs lamakhulu ase Triassic. <strong>[read by one voice]</strong>

source: The giant dinosaurs of the Triassic. Yes.
ss: Ema-dinosaurs lamakhulu ase Triassic. Yebo.

source: The goal of the Common Voice dataset is to enable anyone in the world to build speech recognition, speaker recognition, or any other type of application that requires voice data. A voice assistant is just one of many types of applications you could use the dataset to build.
ss: Umgomo we Common Voice kuvumela noma ngubani emhlabeni kutsi akhe bucwephesha bekulalela inkhulumo, bekuva sikhulumi, noma ke nguliphi luhlobo lwebucwephesha lobudzinga emavi. Insita yelivi incenye nje yetindlela letinengi tebucwephesha longayisebentisa kulomtfombo welwati kwakha.

source: The multi-language version of the Common Voice dataset is currently undergoing community supported bundling and cleaning. If you would like to help us bring Common Voice to new languages, go check out the <sentenceCollectorLink>Sentence Collection Tool</sentenceCollectorLink> for adding new sentences to the dataset, and Mozilla <pontoonLink>Pontoon</pontoonLink> for translating the website itself. New languages are added to Common Voice for voice contribution when 5000 approved sentences have been collected.
ss: Leticheme tetilwimi letiningi telwati ka Common Voice kwanyalo tisachuebeka kuhlanganisa nekuhlantwa ngumphakatsi. Uma utsandza kusista kutsi siletse i- Common Voice etilwini letinsha, hamba uhlole <sentenceCollectorLink>luthulusi lekuhlanganisa imisho</sentenceCollectorLink> kute ungete imisho lemisha kulomtfombo welwati, kanye ne-Mozilla <pontoonLink>Pontoon</pontoonLink> kute uhumushe likhasi lucobo. Tilimi letinsha tengetwa ku-Common Voice kute kusetjentiswe livi lapho imisho legunyatiwe lengu-5000 seikolekiwe.

source: The number of recordings and which languages you contribute to will be public.
ss: Linani lema recording netilwimi losita kuwo kutowentiwa kutsi kutfolwe sive sonkhe.

source: The process by which a contributor’s profile information is obscured from their donated voice clips when packaged for download as a part of the dataset.
ss: Lenchubo lapho imininingwane yalolekelele isuswa emavini akhe lanikele ngawo uma seyipakishwe kahle kutsi ingatsaftwa njengencenye yalombhukudvu welwati.

source: There are a lot of public organizations that might want to collaborate and already have a lot of texts they can donate as public domain. Reach out to local universities, Governments and open source organizations to talk about the project and ask for their help.
ss: Tinengi tinhlangano letingafuna kuhlanganyela futsi lesetinemibhalo lemingi letinganikela ngayo njengensita yesive. Chumana nelikolishi lelidvute nawe, Hulumende kanye netinhlangano temitfombo levulekile kutokhuluma ngalomsebenti futsi ucelel nelisito.

source: There are lots of ways to think about language. For the purposes of speech recognition models, Common Voice suggests focussing on ‘mutual intelligibility’, or ‘can speakers of this language mostly understand one another if they try to?’
ss: Tiningi tindlela tekucabanga ngelulwimi. Ngetinjongo tekuva kahle inkhulumo, i Common Voice igcile kakhulu ku 'mutua intelligibility', noma 'tikhulumi talolwimi lolu tiyevana yini umatezama?'

source: The recording was too long.
ss: Le recording beyiyindze kakhulu.

source: The recording was too quiet.
ss: Le recording beyithule kakhulu.

source: The recording was too short.
ss: Le recording beyiyimfisha kakhulu.

source: There will be natural variations in volume between readers. Reject only if the volume is so high that the recording breaks up, or (more commonly) if it is so low that you can’t hear what is being said without reference to the written text.
ss: Kutoba khona kuhluka kwemvelo ngekwelinani lebafundzi. Yicitse kuphela uma linani lisetulu ngendlela yekutsi nalokutfwebuliwe kuyephatamiseka, noma (ngalokujwayelekile) uma liphansi kangangekutsi awukhoni kuva lokushiwoko ngaphandle kwalokubhaliwe.

source: These languages are currently under community development. <localizationGlossaryLink>Website localization</localizationGlossaryLink> and <sentenceCollectionGlossaryLink>sentence collection</sentenceCollectionGlossaryLink> is needed to launch.
ss: Letilwimi tisatfutfukiswa ngummango. <localizationGlossaryLink>Website localization</localizationGlossaryLink>kanye <sentenceCollectionGlossaryLink> nekukwelekwa kwemisho </sentenceCollectionGlossaryLink> kuyadzigeka kulokusungulwa!

source: The selected file is too large
ss: Lelifayela lolikhetsile likhulu kakhulu.

source: The Sentence Collector is part of <commonVoiceLink>Common Voice</commonVoiceLink>. It allows contributors to collect and validate sentences created by the community. You can use this tool also to import and clean-up small-to-medium-sized public domain corpus you have found or collected. All sentences need to be Public Domain. Approved sentences are exported every week to the Common Voice repository and are released on the Common Voice website on every new deployment.
ss: Lomkweleki wemisho uyincenye ye <commonVoiceLink>Common Voice</commonVoiceLink>. Ivumela labanikelako kutsi bakweleke phindze bacinisekise imisho leyakhiwe ngumphakatsi. Ungalisebentisa lelithulusi kudvonsa kanye nekuhlanta lokuncane kuya kulokusemkhatsini lokutfolile noma lokukwelekile. Yonkhe imisho kumele ibe yinsita yemphakatsi. Imisho legunyatiwe itfunyelwa lisontfo linye ekhasini laka Common Voice futsi ikhishwe ekhasini laka Common Voice ngemsebenti lomusha.

source: The sentence has a grammatical or spelling error.
ss: Lomusho unemaphutsa ekuhlelweni nasekubhalweni kwawo

source: The sentence has disrespectful or offensive language.
ss: Lelisentenisi linenhlamba futsi liyalulata.

source: The sentence must be grammatically correct.
ss: Lomusho kumele ube bete emaphutsa.

source: The sentence must be speakable.
ss: Lomusho kumele ukhulumeke.

source: The sentence must be spelled correctly.
ss: Lomusho kumele ubhaleke kahle.

source: The site is ready to be launched when it reaches 75% completion.
ss: Lelikhasi litawusungulwa uma selifike ku 75% kutsi liphele.

source: The site will be back up as soon as possible. For the latest information, please join the <matrixLink>Matrix community chat</matrixLink> or visit <githubLink>GitHub</githubLink> or <discourseLink>our Discourse forums</discourseLink> to submit and monitor site experience issues.
ss: Lelikhasi litawubuya madvute. Kute utfole lwati lolusha, sicela ungenele i <matrixLink>Matrix community chat </matrixLink>or uvakashele i <githubLink>Github</githubLink> noma i <discourseLink>Discourse forums etfu</discourseLink> kute umikise phindze ucaphele tinkinga telikhasi letfu.

source: The TED-LIUM corpus was made from audio talks and their transcriptions available on the TED website.
ss: Liphephandzaba TED-LUM lakhiwa netinkhulumo letitfwebulie netinchazelo tato lokutfolakala kule TED website.

source: The website text is translated into that language.
ss: Emagama lasekhasini langcondvomshina ahumushwe ngalolulwimi.

source: This is approximately the number of hours required to train a production speech-to-text system.
ss: Leli linani lemahora ladzingekile kuze kuceceshwe umkhiciti we speech-to-text system

source: This is a use case driven segment containing data to power spoken digit recognition and yes / no detection.
ss: Lesigamu sisebenta ngabofeleba sicuketse imininingwane letolekela kuvakala kuviwa kwetinombolo letikhulunyiwe kanye nekuva yebo / cha.

source: This is our process for translating and adapting our content for many locales (languages).
ss: Lena yindlela yekuhumusha phindze sitintise lesikucuketse kubantfu bonkhe (tilwimi).

source: This page gives you an overview of all your submitted sentences. You may also delete already submitted sentences if needed, by marking the checkbox next to it and clicking on &quot;Delete selected sentences&quot; at the bottom. Please only remove sentences if absolutely necessary, for example if you noticed after the fact that a sentence is copyright protected.
ss: Lelikhasi likuniketa sifinyeto sayo yonkhe imisho loyifakile. Ungaphindze futsi ususe imisho lesevele itfunyelwe uma kudzingeka, ngekumaka libhokisi eceleni kwalo bese uchafata ku&quot;Susa imisho lekhetsiwe&quot; ngephansi. Sicela ususe imisho kuphela uma kunesidzingo, sibonelo uma ucaphele ngemuva kwekutsi umusho uvikelwe yi-copyright.

source: This setting controls your leaderboard visibility. When hidden, your progress will be private. This means your image, user name and progress will not appear on the leaderboard. Note that leaderboard refresh takes ~{ $minutes }min to populate changes.
ss: Letinkinobho tilawula kubonaka kwe leaderboard yakho. Uma ifihlakele, umgamu wakho utofihlakala. Loku kusho kutsi sitfombe sakho, ligama lakho lolisebentisako kanye nemgamu wakho neke uvele ku leaderboard. Yati kutsi kuvuselela kwe leaderboard kutsatsa ~~{ $minutes } kufaka tingucuko.

source: Three to go!
ss: Kusele lamatsatfu!

source: Today
ss: Namuhla

source: Today's Common Voice progress on clips recorded
ss: Inchubekela phambili ya Common Voice namuhla ngeticeshana letitfwebuliwe

source: Today's Common Voice progress on clips validated
ss: Inchubekela phambili ya Common Voice namuhla ngeticeshana tacinisekiswa

source: Today's Progress
ss: Inchubo Yanamuhla

source: To make it into the Common Voice dataset, a voice clip must be validated by two separate users.
ss: Kuze ukhone kuba kule Dataset yaka Voice Command, inkhulumo kumele iphasiswe bantfu lababili labehlukene.

source: To make the Common Voice dataset as useful as possible we have decided to only allow source text that is available under a Creative Commons (CC0) license. Using the CC0 standard means its more difficult to find and collect source text, but allows anyone to use the resulting voice data without usage restrictions or authorization from Mozilla. Ultimately, we want to make the multi-language dataset as useful as possible to everyone, including researchers, universities, startups, governments, social purpose organizations, and hobbyists.
ss: Kute sente lomtfombo welwati waka Common Voice kutsi ube yinsita sikhetse kutsi sivumele kuphela umtfombo wemagama lokhona ngephansi kwemvume ye Creative Commons CC0. Kusebentisa lemigomo ye CC0 kusho kutsi kulukhuni kakuhlu kutfola nekukweleka umtfombo wemagama, konja kuvumela noma ngangubani kusebentisa lomphumela we lwati lelivi ngaphandle wekuba nemkhawulo wekuwusebentisa noma imvumo lesuka ka Mozilla. Ekugcineni, sifuna kwakha lomtfombo welwati wetilwimi letehlukene kutsi usebentiseke kuwonkhe wonkhe, kufaka ekhatsi bacwaningi, emanyuvesi, labacalako, bohulumende, tinhlangangano tesive kanye nalabatilibatisako.

source: Top Contributors
ss: Labalekelele bahamba ephambili

source: Total
ss: Konkhe

source: Total Approved
ss: Lokuvunyiwe sekukonkhe

source: { $totalHours } hours is achievable in just over { $periodMonths } months if { $people } people record { $clipsPerDay } clips a day.
ss: { $totalHours } emohora lingenteka ngeku { $periodMonths } tinyanga uma { $people } bantfu bayatfwebula { $clipsPerDay } ticephu ngelilanga

source: { $totalInReview } sentences in review.
ss: { $totalInReview } umusho lobuketwako.

source: { $totalSentences } total sentences.
ss: { $totalSentences } imisho lephelele.

source: To the right we outline the benefits and clarify what information we make public. Use the links below to get started with a Common Voice account on your own device.
ss: Ngesukudla sichaze inzuzo phindze sachaza ngelwati lesilinika sive. Sebentisa tichumanisi letingentasi kute ucale ngeligama lakho ku Common Voice ecingweni lakho.
